PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f25k50.inc
;----- SSP1CON3 Bits -----------------------------------------------------
DHEN             EQU  H'0000'
AHEN             EQU  H'0001'
SBCDE            EQU  H'0002'
SDAHT            EQU  H'0003'
BOEN             EQU  H'0004'
SCIE             EQU  H'0005'
PCIE             EQU  H'0006'
ACKTIM           EQU  H'0007'


;----- SSPCON3 Bits -----------------------------------------------------
DHEN             EQU  H'0000'
AHEN             EQU  H'0001'
SBCDE            EQU  H'0002'
SDAHT            EQU  H'0003'
BOEN             EQU  H'0004'
SCIE             EQU  H'0005'
PCIE             EQU  H'0006'
ACKTIM           EQU  H'0007'


;----- T1GCON Bits -----------------------------------------------------
T1GVAL           EQU  H'0002'
T1GGO_NOT_T1DONE EQU  H'0003'
T1GSPM           EQU  H'0004'
T1GTM            EQU  H'0005'
T1GPOL           EQU  H'0006'
TMR1GE           EQU  H'0007'

T1GSS0           EQU  H'0000'
T1GSS1           EQU  H'0001'
T1GGO            EQU  H'0003'

NOT_T1DONE       EQU  H'0003'

T1DONE           EQU  H'0003'

T1GGO_NOT_DONE   EQU  H'0003'


;----- T1CON Bits -----------------------------------------------------
TMR1ON           EQU  H'0000'
RD16             EQU  H'0001'
NOT_T1SYNC       EQU  H'0002'
SOSCEN           EQU  H'0003'

T1RD16           EQU  H'0001'
T1SYNC           EQU  H'0002'
T1SOSCEN         EQU  H'0003'
T1CKPS0          EQU  H'0004'
T1CKPS1          EQU  H'0005'
TMR1CS0          EQU  H'0006'
TMR1CS1          EQU  H'0007'

T1OSCEN          EQU  H'0003'


;----- RCON Bits -----------------------------------------------------
NOT_BOR          EQU  H'0000'
NOT_POR          EQU  H'0001'
NOT_PD           EQU  H'0002'
NOT_TO           EQU  H'0003'
NOT_RI           EQU  H'0004'
SBOREN           EQU  H'0006'
IPEN             EQU  H'0007'

BOR              EQU  H'0000'
POR              EQU  H'0001'
PD               EQU  H'0002'
TO               EQU  H'0003'
RI               EQU  H'0004'


;----- WDTCON Bits -----------------------------------------------------
SWDTEN           EQU  H'0000'

SWDTE            EQU  H'0000'


;----- OSCCON2 Bits -----------------------------------------------------
LFIOFS           EQU  H'0000'
HFIOFR           EQU  H'0001'
PRISD            EQU  H'0002'
SOSCGO           EQU  H'0003'
PLLEN            EQU  H'0004'
INTSRC           EQU  H'0005'
SOSCRUN          EQU  H'0006'
PLLRDY           EQU  H'0007'


;----- OSCCON Bits -----------------------------------------------------
HFIOFS           EQU  H'0002'
OSTS             EQU  H'0003'
IDLEN            EQU  H'0007'

SCS0             EQU  H'0000'
SCS1             EQU  H'0001'
FLTS             EQU  H'0002'
IRCF0            EQU  H'0004'
IRCF1            EQU  H'0005'
IRCF2            EQU  H'0006'


;----- T0CON Bits -----------------------------------------------------
PSA              EQU  H'0003'
T0SE             EQU  H'0004'
T0CS             EQU  H'0005'
T08BIT           EQU  H'0006'
TMR0ON           EQU  H'0007'

T0PS0            EQU  H'0000'
T0PS1            EQU  H'0001'
T0PS2            EQU  H'0002'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV               EQU  H'0003'
N                EQU  H'0004'


;----- INTCON3 Bits -----------------------------------------------------
INT1IF           EQU  H'0000'
INT2IF           EQU  H'0001'
INT1IE           EQU  H'0003'
INT2IE           EQU  H'0004'
INT1IP           EQU  H'0006'
INT2IP           EQU  H'0007'

INT1F            EQU  H'0000'
INT2F            EQU  H'0001'
INT1E            EQU  H'0003'
INT2E            EQU  H'0004'
INT1P            EQU  H'0006'
INT2P            EQU  H'0007'


;----- INTCON2 Bits -----------------------------------------------------
IOCIP            EQU  H'0000'
TMR0IP           EQU  H'0002'
INTEDG2          EQU  H'0004'
INTEDG1          EQU  H'0005'
INTEDG0          EQU  H'0006'
NOT_RBPU         EQU  H'0007'

T0IP             EQU  H'0002'
RBPU             EQU  H'0007'


;----- INTCON Bits -----------------------------------------------------
IOCIF            EQU  H'0000'
INT0IF           EQU  H'0001'
TMR0IF           EQU  H'0002'
IOCIE            EQU  H'0003'
INT0IE           EQU  H'0004'
TMR0IE           EQU  H'0005'
PEIE_GIEL        EQU  H'0006'
GIE_GIEH         EQU  H'0007'

INT0F            EQU  H'0001'
T0IF             EQU  H'0002'
INT0E            EQU  H'0004'
T0IE             EQU  H'0005'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'

GIEL             EQU  H'0006'
GIEH             EQU  H'0007'


;----- STKPTR Bits -----------------------------------------------------
STKUNF           EQU  H'0006'
STKFUL           EQU  H'0007'

SP0              EQU  H'0000'
SP1              EQU  H'0001'
SP2              EQU  H'0002'
SP3              EQU  H'0003'
SP4              EQU  H'0004'
STKOVF           EQU  H'0007'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'0800'-H'0F52'
       __BADRAM  H'0F53'-H'0F56'
       __BADRAM  H'0F5E'-H'0F5F'
       __BADRAM  H'0F83'
       __BADRAM  H'0F8C'-H'0F8D'
       __BADRAM  H'0F95'-H'0F96'
       __BADRAM  H'0FAA'
       __BADRAM  H'0FD4'

;==========================================================================
;
;   IMPORTANT: For the PIC18 devices, the __CONFIG directive has been
;              superseded by the CONFIG directive.  The following settings
;              are available for this device.
;
;   PLL Selection:
;     PLLSEL = PLL4X       4x clock multiplier
;     PLLSEL = PLL3X       3x clock multiplier
;
;   PLL Enable Configuration bit:
;     CFGPLLEN = OFF       PLL Disabled (firmware controlled)
;     CFGPLLEN = ON        PLL Enabled
;
;   CPU System Clock Postscaler:
;     CPUDIV = NOCLKDIV    CPU uses system clock (no divide)
;     CPUDIV = CLKDIV2     CPU uses system clock divided by 2
;     CPUDIV = CLKDIV3     CPU uses system clock divided by 3
;     CPUDIV = CLKDIV6     CPU uses system clock divided by 6
;
;   Low Speed USB mode with 48 MHz system clock:
;     LS48MHZ = SYS24X4    System clock at 24 MHz, USB clock divider is set to 4
;     LS48MHZ = SYS48X8    System clock at 48 MHz, USB clock divider is set to 8
;
;   Oscillator Selection:
;     FOSC = LP            LP oscillator
;     FOSC = XT            XT oscillator
;     FOSC = HSH           HS oscillator, high power 16MHz to 25MHz
;     FOSC = HSM           HS oscillator, medium power 4MHz to 16MHz
;     FOSC = ECHCLKO       EC oscillator, high power 16MHz to 48MHz, clock output on OSC2
;     FOSC = ECHIO         EC oscillator, high power 16MHz to 48MHz
;     FOSC = RCCLKO        External RC oscillator, clock output on OSC2
;     FOSC = RCIO          External RC oscillator
;     FOSC = INTOSCIO      Internal oscillator
;     FOSC = INTOSCCLKO    Internal oscillator, clock output on OSC2
;     FOSC = ECMCLKO       EC oscillator, medium power 4MHz to 16MHz, clock output on OSC2
;     FOSC = ECMIO         EC oscillator, medium power 4MHz to 16MHz
;     FOSC = ECLCLKO       EC oscillator, low power <4MHz, clock output on OSC2
;     FOSC = ECLIO         EC oscillator, low power <4MHz
;
;   Primary Oscillator Shutdown:
;     PCLKEN = OFF         Primary oscillator shutdown firmware controlled
;     PCLKEN = ON          Primary oscillator enabled
;
;   Fail-Safe Clock Monitor:
;     FCMEN = OFF          Fail-Safe Clock Monitor disabled
;     FCMEN = ON           Fail-Safe Clock Monitor enabled
;
;   Internal/External Oscillator Switchover:
;     IESO = OFF           Oscillator Switchover mode disabled
;     IESO = ON            Oscillator Switchover mode enabled
;
;   Power-up Timer Enable:
;     nPWRTEN = ON         Power up timer enabled
;     nPWRTEN = OFF        Power up timer disabled
;
;   Brown-out Reset Enable:
;     BOREN = OFF          BOR disabled in hardware (SBOREN is ignored)
;     BOREN = ON           BOR controlled by firmware (SBOREN is enabled)
;     BOREN = NOSLP        BOR enabled in hardware, disabled in Sleep mode (SBOREN is ignored)
;     BOREN = SBORDIS      BOR enabled in hardware (SBOREN is ignored)
;
;   Brown-out Reset Voltage:
;     BORV = 285           BOR set to 2.85V nominal
;     BORV = 250           BOR set to 2.5V nominal
;     BORV = 220           BOR set to 2.2V nominal
;     BORV = 190           BOR set to 1.9V nominal
;
;   Low-Power Brown-out Reset:
;     nLPBOR = ON          Low-Power Brown-out Reset enabled
;     nLPBOR = OFF         Low-Power Brown-out Reset disabled
;
;   Watchdog Timer Enable bits:
;     WDTEN = OFF          WDT disabled in hardware (SWDTEN ignored)
;     WDTEN = NOSLP        WDT enabled in hardware, disabled in Sleep mode (SWDTEN ignored)
;     WDTEN = SWON         WDT controlled by firmware (SWDTEN enabled)
;     WDTEN = ON           WDT enabled in hardware (SWDTEN ignored)
;
;   Watchdog Timer Postscaler:
;     WDTPS = 1            1:1
;     WDTPS = 2            1:2
;     WDTPS = 4            1:4
;     WDTPS = 8            1:8
;     WDTPS = 16           1:16
;     WDTPS = 32           1:32
;     WDTPS = 64           1:64
;     WDTPS = 128          1:128
;     WDTPS = 256          1:256
;     WDTPS = 512          1:512
;     WDTPS = 1024         1:1024
;     WDTPS = 2048         1:2048
;     WDTPS = 4096         1:4096
;     WDTPS = 8192         1:8192
;     WDTPS = 16384        1:16384
;     WDTPS = 32768        1:32768
;
;   CCP2 MUX bit:
;     CCP2MX = RB3         CCP2 input/output is multiplexed with RB3
;     CCP2MX = RC1         CCP2 input/output is multiplexed with RC1
;
;   PORTB A/D Enable bit:
;     PBADEN = OFF         PORTB<5:0> pins are configured as digital I/O on Reset
;     PBADEN = ON          PORTB<5:0> pins are configured as analog input channels on Reset
;
;   Timer3 Clock Input MUX bit:
;     T3CMX = RB5          T3CKI function is on RB5
;     T3CMX = RC0          T3CKI function is on RC0
;
;   SDO Output MUX bit:
;     SDOMX = RC7          SDO function is on RC7
;     SDOMX = RB3          SDO function is on RB3
;
;   Master Clear Reset Pin Enable:
;     MCLRE = OFF          RE3 input pin enabled; external MCLR disabled
;     MCLRE = ON           MCLR pin enabled; RE3 input disabled
;
;   Stack Full/Underflow Reset:
;     STVREN = OFF         Stack full/underflow will not cause Reset
;     STVREN = ON          Stack full/underflow will cause Reset
;
;   Single-Supply ICSP Enable bit:
;     LVP = OFF            Single-Supply ICSP disabled
;     LVP = ON             Single-Supply ICSP enabled if MCLRE is also 1
;
;   Dedicated In-Circuit Debug/Programming Port Enable:
;     ICPRT = OFF          ICPORT disabled
;
;   Extended Instruction Set Enable bit:
;     XINST = OFF          Instruction set extension and Indexed Addressing mode disabled
;     XINST = ON           Instruction set extension and Indexed Addressing mode enabled
;
;   Background Debugger Enable bit:
;     DEBUG = ON           Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug
;     DEBUG = OFF          Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins
;
;   Block 0 Code Protect:
;     CP0 = ON             Block 0 is code-protected
;     CP0 = OFF            Block 0 is not code-protected
;
;   Block 1 Code Protect:
;     CP1 = ON             Block 1 is code-protected
;     CP1 = OFF            Block 1 is not code-protected
;
;   Block 2 Code Protect:
;     CP2 = ON             Block 2 is code-protected
;     CP2 = OFF            Block 2 is not code-protected
;
;   Block 3 Code Protect:
;     CP3 = ON             Block 3 is code-protected
;     CP3 = OFF            Block 3 is not code-protected
;
;   Boot Block Code Protect:
;     CPB = ON             Boot block is code-protected
;     CPB = OFF            Boot block is not code-protected
;
;   Data EEPROM Code Protect:
;     CPD = ON             Data EEPROM is code-protected
;     CPD = OFF            Data EEPROM is not code-protected
;
;   Block 0 Write Protect:
;     WRT0 = ON            Block 0 (0800-1FFFh) is write-protected
;     WRT0 = OFF           Block 0 (0800-1FFFh) is not write-protected
;
;   Block 1 Write Protect:
;     WRT1 = ON            Block 1 (2000-3FFFh) is write-protected
;     WRT1 = OFF           Block 1 (2000-3FFFh) is not write-protected
;
;   Block 2 Write Protect:
;     WRT2 = ON            Block 2 (04000-5FFFh) is write-protected
;     WRT2 = OFF           Block 2 (04000-5FFFh) is not write-protected
;
;   Block 3 Write Protect:
;     WRT3 = ON            Block 3 (06000-7FFFh) is write-protected
;     WRT3 = OFF           Block 3 (06000-7FFFh) is not write-protected
;
;   Configuration Registers Write Protect:
;     WRTC = ON            Configuration registers (300000-3000FFh) are write-protected
;     WRTC = OFF           Configuration registers (300000-3000FFh) are not write-protected
;
;   Boot Block Write Protect:
;     WRTB = ON            Boot block (0000-7FFh) is write-protected
;     WRTB = OFF           Boot block (0000-7FFh) is not write-protected
;
;   Data EEPROM Write Protect:
;     WRTD = ON            Data EEPROM is write-protected
;     WRTD = OFF           Data EEPROM is not write-protected
;
;   Block 0 Table Read Protect:
;     EBTR0 = ON           Block 0 is protected from table reads executed in other blocks
;     EBTR0 = OFF          Block 0 is not protected from table reads executed in other blocks
;
;   Block 1 Table Read Protect:
;     EBTR1 = ON           Block 1 is protected from table reads executed in other blocks
;     EBTR1 = OFF          Block 1 is not protected from table reads executed in other blocks
;
;   Block 2 Table Read Protect:
;     EBTR2 = ON           Block 2 is protected from table reads executed in other blocks
;     EBTR2 = OFF          Block 2 is not protected from table reads executed in other blocks
;
;   Block 3 Table Read Protect:
;     EBTR3 = ON           Block 3 is protected from table reads executed in other blocks
;     EBTR3 = OFF          Block 3 is not protected from table reads executed in other blocks
;
;   Boot Block Table Read Protect:
;     EBTRB = ON           Boot block is protected from table reads executed in other blocks
;     EBTRB = OFF          Boot block is not protected from table reads executed in other blocks
;
;==========================================================================
;==========================================================================
;
;       Configuration Bits
;
;   NAME            Address
;   CONFIG1L        300000h
;   CONFIG1H        300001h
;   CONFIG2L        300002h
;   CONFIG2H        300003h
;   CONFIG3H        300005h
;   CONFIG4L        300006h
;   CONFIG5L        300008h
;   CONFIG5H        300009h
;   CONFIG6L        30000Ah
;   CONFIG6H        30000Bh
;   CONFIG7L        30000Ch
;   CONFIG7H        30000Dh
;
;==========================================================================

; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1L        EQU  H'300000'
_CONFIG1H        EQU  H'300001'
_CONFIG2L        EQU  H'300002'
_CONFIG2H        EQU  H'300003'
_CONFIG3H        EQU  H'300005'
_CONFIG4L        EQU  H'300006'
_CONFIG5L        EQU  H'300008'
_CONFIG5H        EQU  H'300009'
_CONFIG6L        EQU  H'30000A'
_CONFIG6H        EQU  H'30000B'
_CONFIG7L        EQU  H'30000C'
_CONFIG7H        EQU  H'30000D'

;----- CONFIG1L Options --------------------------------------------------
_PLLSEL_PLL4X_1L     EQU  H'FE'    ; 4x clock multiplier
_PLLSEL_PLL3X_1L     EQU  H'FF'    ; 3x clock multiplier

_CFGPLLEN_OFF_1L     EQU  H'FD'    ; PLL Disabled (firmware controlled)
_CFGPLLEN_ON_1L      EQU  H'FF'    ; PLL Enabled

_CPUDIV_NOCLKDIV_1L  EQU  H'E7'    ; CPU uses system clock (no divide)
_CPUDIV_CLKDIV2_1L   EQU  H'EF'    ; CPU uses system clock divided by 2
_CPUDIV_CLKDIV3_1L   EQU  H'F7'    ; CPU uses system clock divided by 3
_CPUDIV_CLKDIV6_1L   EQU  H'FF'    ; CPU uses system clock divided by 6

_LS48MHZ_SYS24X4_1L  EQU  H'DF'    ; System clock at 24 MHz, USB clock divider is set to 4
_LS48MHZ_SYS48X8_1L  EQU  H'FF'    ; System clock at 48 MHz, USB clock divider is set to 8

